tsung/tsung_example.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="cs291.com" port="443" type="ssl"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    <!-- </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase> -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <options>
        <dyn_variable name="user_id" file="users.csv" />
        <dyn_variable name="username" file="users.csv" />
    </options>
  </options>

  <!-- Desired Workflow -->
    <session name="login_workflow" type="ts_http" weight="1">
      <!-- Step 1: Login -->
      <request>
        <http method="POST" url="/login" version="1.1">
          <http_header name="Content-Type" value="application/x-www-form-urlencoded"/>
          <body>username=%_username%</body>
        </http>
      </request>
      
      <!-- Step 2: View all listings -->
      <request>
        <http method="GET" url="/" version="1.1"></http>
      </request>

      <!-- Step 3: Wait 1 second -->
      <thinktime value="1"></thinktime>

      <!-- Step 4: Logout -->
      <request>
        <http method="POST" url="/logout" version="1.1"></http>
      </request>
    </session>
</tsung>